app/views/events/edit.html.erb

SELECT "events".* FROM "events"
---
       <div class="label"><%= f.label 'category:' %></div>
       <%categories = Event.all.collect(&:type).compact.uniq%>