app/views/events/new.html.erb

       <div class="label"><%= f.label 'category:' %></div>
       <%categories = Event.all.collect(&:type).compact.uniq%>
---
SELECT "events".* FROM "events"