app/views/events/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1  [["event_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1  [["event_id", 1]]
---
	<%= @event.name %>
	<%= @event.users.count %>

SELECT  "speakers".* FROM "speakers" INNER JOIN "events_speakers" ON "speakers"."id" = "events_speakers"."speaker_id" WHERE "events_speakers"."event_id" = $1 AND "speakers"."name" = $2 LIMIT $3  [["event_id", 1], ["name", "manik chand vikram mudliyar"], ["LIMIT", 1]]
---
<h5>spekers details</h5>
	<% event_speaker = @event.speakers.collect{|x| x.name}.uniq.map {|a| Speaker.find_by_name(a)} %>

SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."name" = $1 LIMIT $2  [["name", "hrr"], ["LIMIT", 1]]
---
<h5>sponsor details</h5>
	<% event_sponsor = @event.sponsors.collect{|x| x.name}.uniq.map {|a| Sponsor.find_by_name(a)} %>