app/views/sponsors/new.html.erb

SELECT "sponsors".* FROM "sponsors"
---
       <div class="label"><%= f.label 'name:' %></div>
       <%sponsors = Sponsor.all.collect(&:name).compact.uniq%>