app/controllers/events_controller.rb

	def index
		@events = Event.all
---
SELECT "events".* FROM "events" WHERE (start_date > '2017-06-18 14:23:13.926127')

	def show
		@event = Event.find_by_id(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@event = Event.new(event_params.merge({:type => params[:type]}))
		if @event.save
---
INSERT INTO "events" ("name", "venue", "country", "city", "type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "qwd"], ["venue", ""], ["country", ""], ["city", ""], ["type", "Cricket"], ["created_at", 2017-06-18 15:40:51 UTC], ["updated_at", 2017-06-18 15:40:51 UTC]]

	def register_for_event
		if session[:user_id] && params[:event_id]
			event = Event.find_by_id(params[:event_id])
			if event
				event.users << User.find_by_id(session[:user_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def edit
		@event = Event.find_by_id(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@event = Event.find_by_id(params[:id])
		if @event.update(event_params.merge({:type => params[:type]}))
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "type" = $1, "start_date" = $2, "end_date" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["type", "Cricket"], ["start_date", 2017-06-01 00:00:00 UTC], ["end_date", 2017-06-18 00:00:00 UTC], ["updated_at", 2017-06-18 17:44:53 UTC], ["id", 4]]