app/controllers/login_controller.rb

  def check
    @user=User.where(:email => params[:email], :password => params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2  [["email", "balamurugan"], ["password", "balamurugan"]]