app/controllers/speakers_controller.rb

	def index
		#@speakers = Speaker.all
		@speakers=Speaker.all.collect(&:name).uniq.map{|x| Speaker.find_by_name(x)}
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."name" = $1 LIMIT $2  [["name", "siva"], ["LIMIT", 1]]

	def show
		@speaker = Speaker.find_by_id(params[:id])
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@speaker = Speaker.new(speaker_params)
		@event=Event.find_by_id(session[:event_id])
		@event.speakers << @speaker
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "speakers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "manik chand vikram mudliyar"], ["created_at", 2017-06-19 02:07:30 UTC], ["updated_at", 2017-06-19 02:07:30 UTC]]

	def edit
		@speaker = Speaker.find_by_id(params[:id])
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@speaker = Speaker.find_by_id(params[:id])
		if @speaker.update(speaker_params)
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "speakers" SET "name" = $1, "updated_at" = $2 WHERE "speakers"."id" = $3  [["name", "manik chand vikram mudliyar"], ["updated_at", 2017-06-19 02:26:49 UTC], ["id", 3]]

    def create_new_speaker
        @speaker=Speaker.new(speaker_params)
       if @speaker.save
---
INSERT INTO "speakers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "siva"], ["created_at", 2017-06-19 06:26:26 UTC], ["updated_at", 2017-06-19 06:26:26 UTC]]

	def destroy
         @speaker = Speaker.find_by_id(params[:id])
         if @speaker.destroy
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "speakers" WHERE "speakers"."id" = $1  [["id", 1]]