app/controllers/speakers_controller.rb

	def index
		@speakers = Speaker.all
---
SELECT "speakers".* FROM "speakers"