app/controllers/sponsors_controller.rb

	def index
		#@speakers = Speaker.all
		@sponsors=Sponsor.all.collect(&:name).uniq.map{|x| Sponsor.find_by_name(x)}
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."name" = $1 LIMIT $2  [["name", "hr"], ["LIMIT", 1]]

	def show
		@sponsor = Sponsor.find_by_id(params[:id])
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@sponsor = Sponsor.new(sponsor_params)
		@event=Event.find_by_id(session[:event_id])
		@event.sponsors << @sponsor
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sponsors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hrr"], ["created_at", 2017-06-19 07:21:22 UTC], ["updated_at", 2017-06-19 07:21:22 UTC]]

	def edit
		@sponsor = Sponsor.find_by_id(params[:id])
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@sponsor = Sponsor.find_by_id(params[:id])
		if @sponsor.update(sponsor_params)
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "sponsors" SET "name" = $1, "updated_at" = $2 WHERE "sponsors"."id" = $3  [["name", "hrr"], ["updated_at", 2017-06-19 07:21:04 UTC], ["id", 1]]

    def create_new_sponsor
        @sponsor=Sponsor.new(sponsor_params)
       if @sponsor.save
---
INSERT INTO "sponsors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hr"], ["created_at", 2017-06-19 07:20:41 UTC], ["updated_at", 2017-06-19 07:20:41 UTC]]