app/controllers/sponsors_controller.rb

SELECT "sponsors".* FROM "sponsors"
---
	def index
		@sponsors = Sponsor.all