app/controllers/users_controller.rb

    def create
      @user=User.new(params_user)
      @user.save
---
INSERT INTO "users" ("name", "email", "password", "father_name", "mother_name", "profession", "city", "state", "country", "created_at", "updated_at", "phone_no") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

    def edit
      @user=User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
          @user = User.find_by_id(params[:id])
      if @user.update(params_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "manik"], ["password", "manik"], ["updated_at", 2017-06-18 18:50:52 UTC], ["id", 2]]