app/views/speakers/new.html.erb

       <div class="label"><%= f.label 'name:' %></div>
       <%speakers = Speaker.all.collect(&:name).compact.uniq%>
---
SELECT "speakers".* FROM "speakers"